In [12]:
import pandas as pd
import numpy as np

In [13]:
string_data = pd.Series([None, 'Heart', np.nan, 'Club', 'Diamond', 'Spade'])
string_data.isnull()  # both None and NaN are null

0     True
1    False
2     True
3    False
4    False
5    False
dtype: bool

### Filtering Out Missing Data

In [14]:
string_data.dropna()  # same as string_data[string_data.notnull()]

1      Heart
3       Club
4    Diamond
5      Spade
dtype: object

In [21]:
data = pd.DataFrame([[1., 6.5, 3.], 
                     [1., np.nan, 9.], 
                     [np.nan, np.nan, np.nan], 
                     [31., 6.2, np.nan]])
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(how = 'all')

      0    1    2
0   1.0  6.5  3.0
1   1.0  NaN  9.0
3  31.0  6.2  NaN

In [23]:
data[4] = np.nan
data

      0    1    2   4
0   1.0  6.5  3.0 NaN
1   1.0  NaN  9.0 NaN
2   NaN  NaN  NaN NaN
3  31.0  6.2  NaN NaN

In [24]:
data.dropna(axis = 1, how = 'all')

      0    1    2
0   1.0  6.5  3.0
1   1.0  NaN  9.0
2   NaN  NaN  NaN
3  31.0  6.2  NaN

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = np.nan
df.loc[:2, 2] = np.nan
df

          0         1         2
0 -1.248258       NaN       NaN
1  0.913377       NaN       NaN
2  0.618760       NaN       NaN
3  0.563825       NaN  0.240473
4 -0.672253       NaN -0.173115
5 -1.308012 -0.958530  0.856166
6 -0.316555 -0.757829 -1.237180

In [29]:
df.dropna(thresh = 2)  # contain more than 2 numbers

          0         1         2
3  0.563825       NaN  0.240473
4 -0.672253       NaN -0.173115
5 -1.308012 -0.958530  0.856166
6 -0.316555 -0.757829 -1.237180

### Filling in Missing Data

In [30]:
df.fillna(0)

          0         1         2
0 -1.248258  0.000000  0.000000
1  0.913377  0.000000  0.000000
2  0.618760  0.000000  0.000000
3  0.563825  0.000000  0.240473
4 -0.672253  0.000000 -0.173115
5 -1.308012 -0.958530  0.856166
6 -0.316555 -0.757829 -1.237180

In [31]:
df.fillna({1: 9, 2: 2})

          0         1         2
0 -1.248258  9.000000  2.000000
1  0.913377  9.000000  2.000000
2  0.618760  9.000000  2.000000
3  0.563825  9.000000  0.240473
4 -0.672253  9.000000 -0.173115
5 -1.308012 -0.958530  0.856166
6 -0.316555 -0.757829 -1.237180

In [34]:
df_2 = pd.DataFrame(np.random.randn(6, 3))
df_2.loc[2:, 1] = np.nan
df_2.loc[4:, 2] = np.nan
df_2

          0         1         2
0  0.031330 -0.271544 -2.166295
1 -1.566981  1.313600  0.432459
2 -1.622413       NaN  0.325190
3 -0.333922       NaN -0.181111
4 -1.505866       NaN       NaN
5 -0.588071       NaN       NaN

In [35]:
df_2.fillna(method = 'ffill', limit = 1)

          0         1         2
0  0.031330 -0.271544 -2.166295
1 -1.566981  1.313600  0.432459
2 -1.622413  1.313600  0.325190
3 -0.333922       NaN -0.181111
4 -1.505866       NaN -0.181111
5 -0.588071       NaN       NaN